## 🚀 Terragrunt Apply Completed

**Project**: claude-code-action
**Environment**: `develop`
**Directory**: `infrastructures/claude-code-action/terragrunt/envs/develop`
**Status**: ✅ Success
**Action**: apply

<details>
<summary>📝 Apply Output</summary>

```hcl
17:43:25.861 INFO   Downloading Terraform configurations from ../../modules into ./.terragrunt-cache/my1UPtLMQLjicnyXBzdFZQO2ZLc/lpQGwm1_HFfaA93KgqixzLjaxyE
17:43:26.910 INFO   terraform: Initializing the backend...
17:43:28.184 INFO   terraform: 
17:43:28.184 INFO   terraform: Successfully configured the backend "s3"! Terraform will automatically
17:43:28.184 INFO   terraform: use this backend unless the backend configuration changes.
17:43:29.171 INFO   terraform: Initializing provider plugins...
17:43:29.171 INFO   terraform: - Finding hashicorp/tls versions matching "~> 4.0"...
17:43:29.334 INFO   terraform: - Finding hashicorp/aws versions matching "~> 5.0"...
17:43:29.449 INFO   terraform: - Installing hashicorp/tls v4.1.0...
17:43:29.644 INFO   terraform: - Installed hashicorp/tls v4.1.0 (signed by HashiCorp)
17:43:29.743 INFO   terraform: - Installing hashicorp/aws v5.100.0...
17:43:33.628 INFO   terraform: - Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
17:43:33.628 INFO   terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
17:43:33.628 INFO   terraform: selections it made above. Include this file in your version control repository
17:43:33.628 INFO   terraform: so that Terraform can guarantee to make the same selections by default when
17:43:33.629 INFO   terraform: you run "terraform init" in the future.
17:43:33.629 INFO   terraform: Terraform has been successfully initialized!
17:43:35.843 STDOUT terraform: Acquiring state lock. This may take a few moments...
17:43:38.728 STDOUT terraform: data.aws_caller_identity.current: Reading...
17:43:38.877 STDOUT terraform: data.aws_caller_identity.current: Read complete after 0s [id=559744160976]
17:43:39.006 STDOUT terraform: Terraform used the selected providers to generate the following execution
17:43:39.006 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
17:43:39.006 STDOUT terraform:   + create
17:43:39.006 STDOUT terraform: Terraform will perform the following actions:
17:43:39.006 STDOUT terraform:   # aws_iam_policy.bedrock_claude_policy will be created
17:43:39.006 STDOUT terraform:   + resource "aws_iam_policy" "bedrock_claude_policy" {
17:43:39.006 STDOUT terraform:       + arn              = (known after apply)
17:43:39.006 STDOUT terraform:       + attachment_count = (known after apply)
17:43:39.007 STDOUT terraform:       + description      = "Policy for Claude Code Action to access Amazon Bedrock Claude models"
17:43:39.007 STDOUT terraform:       + id               = (known after apply)
17:43:39.007 STDOUT terraform:       + name             = "claude-code-action-develop-bedrock-claude-policy"
17:43:39.007 STDOUT terraform:       + name_prefix      = (known after apply)
17:43:39.007 STDOUT terraform:       + path             = "/"
17:43:39.007 STDOUT terraform:       + policy           = jsonencode(
17:43:39.008 STDOUT terraform:             {
17:43:39.008 STDOUT terraform:               + Statement = [
17:43:39.008 STDOUT terraform:                   + {
17:43:39.008 STDOUT terraform:                       + Action   = [
17:43:39.008 STDOUT terraform:                           + "bedrock:InvokeModel",
17:43:39.008 STDOUT terraform:                           + "bedrock:InvokeModelWithResponseStream",
17:43:39.008 STDOUT terraform:                         ]
17:43:39.008 STDOUT terraform:                       + Effect   = "Allow"
17:43:39.009 STDOUT terraform:                       + Resource = "*"
17:43:39.009 STDOUT terraform:                     },
17:43:39.009 STDOUT terraform:                   + {
17:43:39.009 STDOUT terraform:                       + Action   = [
17:43:39.009 STDOUT terraform:                           + "bedrock:ListFoundationModels",
17:43:39.009 STDOUT terraform:                           + "bedrock:GetFoundationModel",
17:43:39.010 STDOUT terraform:                         ]
17:43:39.010 STDOUT terraform:                       + Effect   = "Allow"
17:43:39.010 STDOUT terraform:                       + Resource = "*"
17:43:39.010 STDOUT terraform:                     },
17:43:39.010 STDOUT terraform:                 ]
17:43:39.010 STDOUT terraform:               + Version   = "2012-10-17"
17:43:39.010 STDOUT terraform:             }
17:43:39.010 STDOUT terraform:         )
17:43:39.010 STDOUT terraform:       + policy_id        = (known after apply)
17:43:39.010 STDOUT terraform:       + tags             = {
17:43:39.010 STDOUT terraform:           + "CostCenter"  = "engineering"
17:43:39.010 STDOUT terraform:           + "Environment" = "develop"
17:43:39.010 STDOUT terraform:           + "ManagedBy"   = "terragrunt"
17:43:39.010 STDOUT terraform:           + "Name"        = "claude-code-action-develop-bedrock-claude-policy"
17:43:39.010 STDOUT terraform:           + "Owner"       = "panicboat"
17:43:39.010 STDOUT terraform:           + "Project"     = "claude-code-action"
17:43:39.011 STDOUT terraform:           + "Purpose"     = "bedrock-claude-access"
17:43:39.011 STDOUT terraform:           + "Repository"  = "panicboat/monorepo"
17:43:39.011 STDOUT terraform:         }
17:43:39.011 STDOUT terraform:       + tags_all         = {
17:43:39.011 STDOUT terraform:           + "CostCenter"  = "engineering"
17:43:39.011 STDOUT terraform:           + "Environment" = "develop"
17:43:39.011 STDOUT terraform:           + "ManagedBy"   = "terragrunt"
17:43:39.011 STDOUT terraform:           + "Name"        = "claude-code-action-develop-bedrock-claude-policy"
17:43:39.011 STDOUT terraform:           + "Owner"       = "panicboat"
17:43:39.011 STDOUT terraform:           + "Project"     = "claude-code-action"
17:43:39.012 STDOUT terraform:           + "Purpose"     = "bedrock-claude-access"
17:43:39.012 STDOUT terraform:           + "Repository"  = "panicboat/monorepo"
17:43:39.012 STDOUT terraform:         }
17:43:39.012 STDOUT terraform:     }
17:43:39.012 STDOUT terraform:   # aws_iam_role.claude_code_action_role will be created
17:43:39.012 STDOUT terraform:   + resource "aws_iam_role" "claude_code_action_role" {
17:43:39.013 STDOUT terraform:       + arn                   = (known after apply)
17:43:39.013 STDOUT terraform:       + assume_role_policy    = jsonencode(
17:43:39.013 STDOUT terraform:             {
17:43:39.013 STDOUT terraform:               + Statement = [
17:43:39.013 STDOUT terraform:                   + {
17:43:39.013 STDOUT terraform:                       + Action    = "sts:AssumeRoleWithWebIdentity"
17:43:39.013 STDOUT terraform:                       + Condition = {
17:43:39.013 STDOUT terraform:                           + StringEquals = {
17:43:39.013 STDOUT terraform:                               + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
17:43:39.013 STDOUT terraform:                             }
17:43:39.013 STDOUT terraform:                           + StringLike   = {
17:43:39.013 STDOUT terraform:                               + "token.actions.githubusercontent.com:sub" = [
17:43:39.013 STDOUT terraform:                                   + "repo:panicboat/monorepo:*",
17:43:39.013 STDOUT terraform:                                 ]
17:43:39.013 STDOUT terraform:                             }
17:43:39.013 STDOUT terraform:                         }
17:43:39.013 STDOUT terraform:                       + Effect    = "Allow"
17:43:39.013 STDOUT terraform:                       + Principal = {
17:43:39.013 STDOUT terraform:                           + Federated = "arn:aws:iam::559744160976:oidc-provider/token.actions.githubusercontent.com"
17:43:39.013 STDOUT terraform:                         }
17:43:39.013 STDOUT terraform:                     },
17:43:39.013 STDOUT terraform:                 ]
17:43:39.013 STDOUT terraform:               + Version   = "2012-10-17"
17:43:39.013 STDOUT terraform:             }
17:43:39.013 STDOUT terraform:         )
17:43:39.013 STDOUT terraform:       + create_date           = (known after apply)
17:43:39.014 STDOUT terraform:       + force_detach_policies = false
17:43:39.014 STDOUT terraform:       + id                    = (known after apply)
17:43:39.014 STDOUT terraform:       + managed_policy_arns   = (known after apply)
17:43:39.014 STDOUT terraform:       + max_session_duration  = 7200
17:43:39.014 STDOUT terraform:       + name                  = "claude-code-action-develop-github-actions-role"
17:43:39.014 STDOUT terraform:       + name_prefix           = (known after apply)
17:43:39.014 STDOUT terraform:       + path                  = "/"
17:43:39.014 STDOUT terraform:       + tags                  = {
17:43:39.014 STDOUT terraform:           + "CostCenter"  = "engineering"
17:43:39.014 STDOUT terraform:           + "Environment" = "develop"
17:43:39.014 STDOUT terraform:           + "GitHubOrg"   = "panicboat"
17:43:39.014 STDOUT terraform:           + "GitHubRepos" = "monorepo"
17:43:39.014 STDOUT terraform:           + "ManagedBy"   = "terragrunt"
17:43:39.014 STDOUT terraform:           + "Name"        = "claude-code-action-develop-github-actions-role"
17:43:39.014 STDOUT terraform:           + "Owner"       = "panicboat"
17:43:39.014 STDOUT terraform:           + "Project"     = "claude-code-action"
17:43:39.014 STDOUT terraform:           + "Purpose"     = "claude-code-action-bedrock"
17:43:39.014 STDOUT terraform:           + "Repository"  = "panicboat/monorepo"
17:43:39.014 STDOUT terraform:         }
17:43:39.014 STDOUT terraform:       + tags_all              = {
17:43:39.014 STDOUT terraform:           + "CostCenter"  = "engineering"
17:43:39.014 STDOUT terraform:           + "Environment" = "develop"
17:43:39.014 STDOUT terraform:           + "GitHubOrg"   = "panicboat"
17:43:39.014 STDOUT terraform:           + "GitHubRepos" = "monorepo"
17:43:39.015 STDOUT terraform:           + "ManagedBy"   = "terragrunt"
17:43:39.015 STDOUT terraform:           + "Name"        = "claude-code-action-develop-github-actions-role"
17:43:39.015 STDOUT terraform:           + "Owner"       = "panicboat"
17:43:39.015 STDOUT terraform:           + "Project"     = "claude-code-action"
17:43:39.015 STDOUT terraform:           + "Purpose"     = "claude-code-action-bedrock"
17:43:39.015 STDOUT terraform:           + "Repository"  = "panicboat/monorepo"
17:43:39.015 STDOUT terraform:         }
17:43:39.015 STDOUT terraform:       + unique_id             = (known after apply)
17:43:39.015 STDOUT terraform:       + inline_policy (known after apply)
17:43:39.015 STDOUT terraform:     }
17:43:39.015 STDOUT terraform:   # aws_iam_role_policy_attachment.bedrock_claude_policy_attachment will be created
17:43:39.015 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "bedrock_claude_policy_attachment" {
17:43:39.015 STDOUT terraform:       + id         = (known after apply)
17:43:39.015 STDOUT terraform:       + policy_arn = (known after apply)
17:43:39.015 STDOUT terraform:       + role       = "claude-code-action-develop-github-actions-role"
17:43:39.015 STDOUT terraform:     }
17:43:39.015 STDOUT terraform: Plan: 3 to add, 0 to change, 0 to destroy.
17:43:39.016 STDOUT terraform: 
17:43:39.016 STDOUT terraform: Changes to Outputs:
17:43:39.016 STDOUT terraform:   + bedrock_models               = [
17:43:39.016 STDOUT terraform:       + "anthropic.claude-3-7-sonnet-20250219-v1:0",
17:43:39.016 STDOUT terraform:     ]
17:43:39.016 STDOUT terraform:   + bedrock_policy_arn           = (known after apply)
17:43:39.016 STDOUT terraform:   + claude_model_region          = "us-west-2"
17:43:39.016 STDOUT terraform:   + github_actions_configuration = {
17:43:39.016 STDOUT terraform:       + aws_region          = "ap-northeast-1"
17:43:39.016 STDOUT terraform:       + bedrock_models      = [
17:43:39.016 STDOUT terraform:           + "anthropic.claude-3-7-sonnet-20250219-v1:0",
17:43:39.016 STDOUT terraform:         ]
17:43:39.016 STDOUT terraform:       + claude_model_region = "us-west-2"
17:43:39.016 STDOUT terraform:       + role_arn            = (known after apply)
17:43:39.016 STDOUT terraform:     }
17:43:39.016 STDOUT terraform:   + iam_role_arn                 = (known after apply)
17:43:39.016 STDOUT terraform:   + iam_role_name                = "claude-code-action-develop-github-actions-role"
17:43:39.928 STDOUT terraform: aws_iam_policy.bedrock_claude_policy: Creating...
17:43:39.929 STDOUT terraform: aws_iam_role.claude_code_action_role: Creating...
17:43:40.220 STDOUT terraform: aws_iam_policy.bedrock_claude_policy: Creation complete after 0s [id=arn:aws:iam::559744160976:policy/claude-code-action-develop-bedrock-claude-policy]
17:43:40.220 STDOUT terraform: aws_iam_role.claude_code_action_role: Creation complete after 0s [id=claude-code-action-develop-github-actions-role]
17:43:40.222 STDOUT terraform: aws_iam_role_policy_attachment.bedrock_claude_policy_attachment: Creating...
17:43:40.358 STDOUT terraform: aws_iam_role_policy_attachment.bedrock_claude_policy_attachment: Creation complete after 0s [id=claude-code-action-develop-github-actions-role-20250622174340317400000001]
17:43:41.143 STDOUT terraform: 
17:43:41.144 STDOUT terraform: Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
17:43:41.144 STDOUT terraform: 
17:43:41.144 STDOUT terraform: Outputs:
17:43:41.144 STDOUT terraform: 
17:43:41.144 STDOUT terraform: bedrock_models = tolist([
17:43:41.144 STDOUT terraform:   "anthropic.claude-3-7-sonnet-20250219-v1:0",
17:43:41.144 STDOUT terraform: ])
17:43:41.144 STDOUT terraform: bedrock_policy_arn = "arn:aws:iam::559744160976:policy/claude-code-action-develop-bedrock-claude-policy"
17:43:41.144 STDOUT terraform: claude_model_region = "us-west-2"
17:43:41.144 STDOUT terraform: github_actions_configuration = {
17:43:41.144 STDOUT terraform:   "aws_region" = "ap-northeast-1"
17:43:41.144 STDOUT terraform:   "bedrock_models" = tolist([
17:43:41.144 STDOUT terraform:     "anthropic.claude-3-7-sonnet-20250219-v1:0",
17:43:41.144 STDOUT terraform:   ])
17:43:41.144 STDOUT terraform:   "claude_model_region" = "us-west-2"
17:43:41.144 STDOUT terraform:   "role_arn" = "arn:aws:iam::559744160976:role/claude-code-action-develop-github-actions-role"
17:43:41.144 STDOUT terraform: }
17:43:41.144 STDOUT terraform: iam_role_arn = "arn:aws:iam::559744160976:role/claude-code-action-develop-github-actions-role"
17:43:41.144 STDOUT terraform: iam_role_name = "claude-code-action-develop-github-actions-role"
```
</details>

[View full workflow logs](https://github.com/panicboat/monorepo/actions/runs/15809214360)
---
*Triggered by workflow automation system*
<!-- thollander/actions-comment-pull-request "terragrunt-apply-develop-claude-code-action" -->